app/Http/Controllers/ProductController.php

SELECT * FROM `products`
---
    public function index()
    {
        $models = Product::all();

SELECT * FROM `tags_products` WHERE `tags_products`.`product_id` = '27' and `tags_products`.`product_id` IS not NULL
SELECT * FROM `categories`
SELECT * FROM `branches`
SELECT * FROM `tags`
---
    public function edit($id, Request $request)
    {
        $model = Product::find($id);
        $product_ids = $model->product_cate_pros;
        $tag_ids = $model->product_tags;

        if($model){
            $categories = Category::all();
            $branches = Branch::all();
            $tags = Tag::all();

SELECT * FROM `products` WHERE `products`.`id` IS NULL LIMIT 1
UPDATE `products` SET `image` = 'phan-tich-doi-thu-canh-tranh-trong-moi-truong-nganh.jpg', `products`.`updated_at` = '2021-07-12 16:31:30' WHERE `id` = '23'
---
    public function update(Request $request)
    {
        $request->validate([
            'name'=>'required',
            'slug'=>'required',
            'image'=>'mimes:jpg,bmp,png',
            'price'=>'required',
            'competitive_price'=>'required',
            'short_desc'=>'required'
        ]);
        $image = '';
        $model = Product::find($request->product_id);
        if($request->hasFile('image')){
            $destinationPath = 'public/images/products';
            $image = $request->file('image');
            $image_name = $image->getClientOriginalName();
            $request->file('image')->storeAs($destinationPath, $image_name);
            $image = $image_name;
            if(file_exists('storage/images/products/'.$model->image)){
                unlink('storage/images/products/'.$model->image);
            }
        } else {
            $image = $request->input('image2');
        }
        if($model){
            $arr1 = [];
            $arr2 = [];
            $model->fill($_POST);
            $model->image = $image;
            $model->save();

DELETE FROM `tags_products` WHERE `product_id` = '23'
INSERT INTO `tags_products` (`product_id`, `tag_id`) VALUES ('25', '1'), ('25', '5'), ('25', '9')
---
                for($i = 0; $i < count($_POST['cate_id']); $i++){
                    $arr1[] = ['cate_id'=>$_POST['cate_id'][$i], 'product_id'=>$model->id];
                }
                Cate_Product::where('product_id', $model->id)->delete();
                Cate_Product::insert($arr1);

DELETE FROM `products` WHERE `id` = '26'
---
                for($i = 0; $i < count($_POST['tag_id']); $i++){
                    $arr2[] = ['tag_id'=>$_POST['tag_id'][$i], 'product_id'=>$model->id];
                }
                Tag_Product::where('product_id', $model->id)->delete();