app/Http/Controllers/ProductController.php

SELECT * FROM `products` WHERE `products`.`id` = '26' LIMIT 1
---
    public function update(Request $request)
    {

        $request->validate([
            'name' => 'required',
            'slug' => 'required',
            'image' => 'mimes:jpg,bmp,png',
            'price' => 'required',
            'competitive_price' => 'required',
            'short_desc' => 'required',
        ]);
        $image = '';
        $model = Product::find($request->product_id);